
* AOC 2023 Day 12

** Initialize 
#+BEGIN_SRC elisp
  (pyvenv-activate "~/projects/project_venv/")
  ; This is needed to make sure python indentation isn't messed up
  (setq org-src-preserve-indentation t)
#+END_SRC

#+RESULTS:
: t

** Day 12 star 1
*** Notes
- Row by row
- . = operational # = damaged ? = unknown
- numbers are distinct groups of damaged springs.
  - Accounts for all springs.
  - Number accounts for entire group
- need a count of permutations of row
- Seems brute forceable?
*** Solution
#+BEGIN_SRC python :results output
import re
def star_1(path: str) -> int:
  with open(path,'r') as f:
    s = 0
    for row in f.read().split("\n"):
      if row:
        springs_s, groups_s = re.search(r"^([?#.]+) ([\d,]+)$", row.strip()).groups()
        groups = groups_s.split(",")
        
        # Brute force
        print(springs,'|',len(groups), len(groups)**2 )
        s+=len(groups)**2

  return s
  
print("Star 1:",star_1("input.txt"))

#+END_SRC

#+RESULTS:
#+begin_example
#??????#??. | 2 4
???#.????#?? | 4 16
.?????#??#?? | 3 9
#.??#?#????? | 4 16
..????##?????.????? | 3 9
#?##???#?#.??.?#?# | 5 25
??????##??#??#??? | 2 4
??..???#?? | 3 9
??##..????.?#.?. | 5 25
?###????#??..???.? | 4 16
#??.???.?#?#?#???# | 6 36
??#????#???.?..??. | 4 16
?.??#??#.????# | 4 16
##??????#.?#??##?? | 4 16
#???.????? | 3 9
?????#?#??.?.?? | 4 16
..??##?????..#?? | 2 4
???????.??.#????? | 2 4
##?.?????#?#???? | 2 4
.?#??.??.???. | 2 4
.?#??##..?# | 3 9
???.??..?##?. | 3 9
???.???##.? | 3 9
??#?#?#???##?????? | 3 9
??...??#?#. | 3 9
?.#?????.??##??#??# | 3 9
?????.#.?????##??? | 6 36
.?#?.???#???. | 2 4
???##????#??#?????.? | 5 25
?????????? | 3 9
??.????.#?#???#?? | 4 16
?????#???#? | 3 9
?????????#?????.?##? | 3 9
????????????. | 2 4
????.???#??????? | 2 4
??#?#?###????.????. | 2 4
.??#??#.?#?##??.?? | 5 25
???#?#?.??? | 2 4
?.??###?##?..#?. | 2 4
..????????.?? | 2 4
#?????.?????#???. | 3 9
#.?????.?.?.???? | 4 16
??????#???????????? | 6 36
#??###?#.?#???#? | 4 16
?.?.##?????.???#? | 4 16
?#?#?#????????. | 3 9
?.???#???.??. | 3 9
?.??#?##?.?#?????.?. | 5 25
?##????#.# | 3 9
???????#????? | 3 9
?##?..?.??#? | 3 9
.???#???????#?????. | 6 36
?#?????#??.????? | 2 4
?#.#??#.????? | 4 16
???.????.???#?#..?. | 2 4
????##???#???? | 2 4
????.???#.?#?? | 4 16
.#?????????????.??# | 5 25
??#??#?#??##???#?? | 3 9
??#.?.???????? | 4 16
???#???.??#??#?? | 3 9
???#?????????##? | 3 9
????#?.##???#?????#? | 5 25
?#??..?.#?????##.??? | 6 36
??#??..?##?.? | 2 4
?#???.????.?? | 4 16
??????#????#?# | 2 4
??????#???? | 2 4
?????.???##??.#??. | 6 36
???#?#..??#. | 3 9
.#??#?????#?.. | 2 4
?#.###??.??##??? | 4 16
?????#?.#?? | 2 4
?????#????.?#?? | 2 4
.#?.#??#?? | 3 9
????#????.??## | 4 16
????.??.##.????? | 4 16
?#.??#?#??? | 2 4
###????????????#?#.? | 3 9
#????.??????.#?##? | 4 16
#?.?.???#??? | 3 9
..##?#.??#? | 2 4
?.?#??.??#?. | 2 4
?.?..?.#.. | 3 9
.??????..?#???????.? | 2 4
??.??##.???#.. | 4 16
??.#??#??. | 3 9
????????#??#?##?? | 2 4
???#????#..????????? | 3 9
.????.?##.??##?#?#. | 4 16
?#?#..?????.??#??#? | 4 16
.#????##??.??.??. | 2 4
????.??.?? | 3 9
?#????.??? | 3 9
.?#?##?.????????.??? | 6 36
??#????.???. | 2 4
.????#??#..?##?.?? | 2 4
#?????#?????????#.? | 2 4
?????#.?#????###???. | 4 16
?#??????.?. | 2 4
???#?#???..#?? | 2 4
??#.????.??##??? | 5 25
??#?.?.#?#?? | 2 4
?????????#?? | 3 9
#??#???#???#.?? | 5 25
.??.??????????? | 5 25
.?#???????.#?? | 3 9
??#??#?????.????#?#? | 6 36
#??????????##???#? | 5 25
?.???..#??? | 3 9
??#?.#?#?.?? | 3 9
.???????#??? | 2 4
???#????#??.#? | 2 4
.???##????#??????.?? | 3 9
???.????#?????#??#. | 6 36
???????????.? | 3 9
???????##???.? | 2 4
.??????????. | 4 16
#??#???#??###???#. | 2 4
??#??.#?#???? | 3 9
.??##?#????.??? | 3 9
.??.?#?#??#??????. | 2 4
?##.???#?#?#?###? | 2 4
?????.??????. | 4 16
..????...?.??? | 2 4
??####?#.???? | 2 4
.?..?##???.???????? | 2 4
???#????#??????#??? | 3 9
.???#??#?..?. | 3 9
?????##??##???? | 5 25
?#?.#?.?####? | 3 9
???#??.#?#??#????#?# | 6 36
??..#?#?#?##..??#? | 5 25
?????????? | 3 9
????.?#???#?#?? | 3 9
??#.???... | 2 4
.??#?????.??#??? | 2 4
?.???????.?#? | 2 4
???????.?#??? | 2 4
???#?#?.?? | 3 9
??.?#.?##????????#?? | 5 25
????.???????.?..? | 5 25
?.?#??.??#???? | 4 16
####??.??#? | 2 4
???#???####?. | 2 4
????????#.?##?.??. | 4 16
.??#.#??.???? | 2 4
?####??#??#?.#.?? | 5 25
?#??#?????.#???? | 5 25
.??..????#.??#? | 3 9
???#.##?##?????? | 4 16
?????????? | 3 9
#??#?#?.????#?#? | 4 16
##?.?#???#.????? | 3 9
.????.#?##??#???..?. | 3 9
?????#????#.????? | 2 4
?????#??.????#? | 4 16
#??#?#??.??#? | 2 4
??.#?????.#????? | 5 25
??#?????#????. | 4 16
?.?#??.??.?.????? | 2 4
??#?#?#???#??.????#? | 2 4
?#?????#?#??..?.? | 4 16
???.#??#?.? | 2 4
?#?#???.??#?? | 4 16
?#?????.?.?? | 4 16
?????#??.?? | 2 4
??.????#..#??#?#?.? | 6 36
??#????.?? | 3 9
#?.???????#.???? | 5 25
?.??.?????.? | 4 16
?????.??#????.?? | 5 25
?..?#??.#?? | 3 9
??????#?#?? | 2 4
??#.?.#??????#??..?? | 6 36
.????##???#??. | 2 4
????##..?..??.? | 2 4
?.???..#?. | 2 4
???????#??#??? | 3 9
???????.#?????? | 5 25
?#?#.??#???.# | 3 9
?#???.?#???#?#????#? | 5 25
?#????.??? | 3 9
??#?##?.????#?.? | 4 16
?.???.????. | 2 4
#?????#?#??#??. | 2 4
????????#??#??? | 5 25
#??.???#???#?#????? | 5 25
???????.?#?.#?. | 3 9
????#????? | 2 4
?.???????#? | 2 4
??.??????.?#?#? | 2 4
.?????#??.#??#..###. | 6 36
???.???.?##?????? | 3 9
#.?.???????.?## | 5 25
##.#??.?.?? | 3 9
?.???.??#?#. | 2 4
????#???.?. | 2 4
..??.##?.?? | 3 9
?#?##??????#?? | 4 16
?####?..??#?.?#?? | 3 9
?#????.#.?#???#? | 5 25
.??#????????#?#? | 2 4
????#?.???##? | 3 9
????.??????#???##? | 5 25
???#??.?????.??# | 4 16
.???#?##?#.????? | 4 16
?#???#?..??????. | 4 16
??????..#?.?##?#?.?? | 4 16
??????????????#?# | 2 4
?.#??????????#.? | 2 4
??????#?..#???# | 3 9
???.?#??###?#??.?#. | 2 4
?.???##????##?#?#? | 3 9
??#??????##????? | 4 16
????????.??. | 3 9
.???#???##? | 3 9
??#.#.????#????. | 4 16
???#..?.#? | 3 9
?#???####??#.???.?#. | 5 25
.???.#?.???? | 4 16
?.??#??#??.?#.?? | 3 9
.????????#? | 2 4
????#?.?.#? | 3 9
???#????.?????#??? | 4 16
?#.?#??#??##?????? | 5 25
??#?#??.#?? | 3 9
???#?????.##.???# | 5 25
?.?#???????????#?#?. | 2 4
?.??#?.?????.???# | 4 16
?#????????.?? | 2 4
??#..#?.??. | 2 4
?#???#????????#?#? | 5 25
.??#???.????..??. | 2 4
#???.#???? | 3 9
?????.##??.?# | 3 9
?#??###??? | 2 4
?#??#?#??.. | 2 4
?????????????.?????? | 3 9
#?#????????? | 3 9
?.??#??###? | 3 9
..#????????..##..?.? | 5 25
??#???#???## | 2 4
?.##??.?????#??.# | 4 16
?#..???????.# | 4 16
###??????#? | 3 9
??.#?#?#????#?????? | 2 4
?????#???????.. | 3 9
?#.?#?..#?#??. | 3 9
???#??#?#?????.. | 2 4
?.#??..?.???.?? | 5 25
??##???.??? | 2 4
??.?##?#??. | 2 4
?.????#?.#? | 3 9
?.#????.????#. | 2 4
?.????.##. | 3 9
?##?#?#???#??? | 2 4
?#?????#?.?#? | 3 9
#?#???#??#??????? | 4 16
?.?#??.?#???#??.?#?# | 4 16
???.#..???# | 2 4
#???????????? | 3 9
##?.????..? | 2 4
??.??####???..#? | 2 4
??##???##??#. | 2 4
?##?????#?#?#?##? | 3 9
?#?.???????.???????# | 6 36
???#?#??.?? | 2 4
??.#?#?#????.# | 3 9
????#?#?#? | 2 4
??#?###?????###? | 3 9
.????#?##.? | 2 4
?.?????#.????####?. | 5 25
#??.#?##??? | 2 4
.?.#??.??#??? | 2 4
?.#???#?.??#????? | 2 4
?.#?#.?#????#???? | 5 25
#.#?????#???? | 2 4
??#????##?.#.#? | 4 16
???????#?##????#???? | 4 16
?#??.?##?????#???##? | 3 9
?...???????#???.. | 2 4
??.#??.??? | 2 4
.??#?.?.###?? | 2 4
?.??.??????. | 2 4
?.??????????? | 2 4
#.##?#?#???#???# | 5 25
??.#??.????# | 4 16
..#???#??????.?.??? | 2 4
.????#?????.?.?? | 2 4
.?#.?????.??? | 4 16
?#.????..??? | 4 16
.??????????#?????#? | 5 25
?????????????#. | 5 25
?#?#??????#?.#?###? | 2 4
.?.?????????# | 4 16
?..##???????. | 2 4
#.??#???????? | 4 16
###????...??? | 2 4
??.....##?#??#? | 2 4
????????.?#?.#. | 5 25
..???????#?? | 2 4
??#?.?#??#??? | 3 9
.#???.?..??. | 4 16
??.?##?????.?.?#? | 3 9
??#??#???#??????##? | 5 25
??.???#??? | 2 4
??#??????.#. | 3 9
..#??#???.#??# | 2 4
?#.?#????###??????? | 5 25
?#??#??#???.#..?? | 4 16
???##??.??#??#??. | 3 9
?.#??#?##?.?###? | 4 16
.#.??#???#? | 3 9
??..????..#??? | 2 4
##????#???#??#??#??? | 2 4
?????#?#?.??.??? | 4 16
???#?..??? | 2 4
.?#??????##???.. | 2 4
??..?.??????#??? | 4 16
??#?.?##??##??#?? | 3 9
???.?????#???.????? | 6 36
.?#??????.?.?? | 4 16
?.??????.??? | 2 4
??###???..?????.? | 3 9
?.?#?????. | 2 4
?####??#?##.?.? | 2 4
#?##?.##?#????.#?# | 5 25
?....?.?????? | 4 16
#.?#???#???#??#??? | 3 9
?.????.??#?? | 2 4
??????#?#?? | 3 9
.?.?.#??.??#??#? | 3 9
#???#???????#?.????? | 5 25
???#??..??#?#.?.. | 2 4
??#????.##?#??????.? | 5 25
?.?????#???#??#?##?# | 5 25
????#?#?#??????? | 5 25
????.#??#.#?????? | 5 25
.#.???.??#??? | 4 16
?##??##?#??.? | 3 9
.???.??????????#?.? | 4 16
???????#???#.#???.? | 6 36
.???#?##??.????##?. | 2 4
??.??????? | 2 4
??#.?#??.???? | 2 4
????#???????.??.#?? | 5 25
.#???????#??##??? | 2 4
?##?#????? | 2 4
???#??#?.?#??##.# | 4 16
..?#??#???? | 2 4
??#?.?.#??#.###?? | 5 25
?####????###?###???. | 2 4
??#?#.???? | 2 4
?###??.??.?.???????? | 4 16
##????..?#? | 3 9
.?#???.#?#?#? | 2 4
??#???#.????.?.?.? | 6 36
??#?????#??????.? | 4 16
????.?#???##.???#? | 5 25
?#??#???#??? | 2 4
?#?????.?#?????## | 3 9
?.???????##?#??????? | 6 36
??.????#?? | 3 9
?????...?..???#?.. | 2 4
??.???????#???#???? | 3 9
???#?#..????#??#. | 4 16
#?.?..#??? | 3 9
.#??#????.#??..???#. | 4 16
.????#?.????????. | 2 4
?.??###?#?????????#? | 2 4
??#.????#?.. | 4 16
??????#.??#??. | 2 4
?.#??#???#?.#????# | 3 9
?????#?#??#?. | 3 9
#?..????##? | 3 9
???????##?#### | 2 4
?..#?.?##?#?#? | 3 9
?????..#??? | 2 4
??.???.#?. | 3 9
????#??##??????#??? | 5 25
#????#?#?????.?? | 4 16
???????#?#???..???? | 5 25
?????##?????? | 3 9
.??..????????# | 3 9
??.#???##??#.#?? | 5 25
.?##?????? | 2 4
.?..?..???? | 3 9
.???????????#?###?.? | 2 4
?????????##???#??#?? | 3 9
???????.?.??.#? | 5 25
???.??#??#???? | 3 9
?????#.##????#??#??? | 6 36
?#???.??#??#.?. | 2 4
?.?#?#???# | 2 4
#..?#???#??????.#? | 6 36
#??????????.?##? | 3 9
????????##?#?.#?.?? | 6 36
.??##?????##??#..?#? | 2 4
??##?????##?#?? | 2 4
.?#?#????####? | 2 4
?#??#?????????? | 3 9
??#????#..?#??##? | 4 16
????.#???.?###?# | 3 9
????#?.??# | 3 9
#?#?#??#????..#???? | 5 25
##?#???#???..??? | 4 16
??#?.????#?#?. | 3 9
.#????#?????#. | 4 16
?..?.???#?????. | 4 16
.?????.???? | 2 4
##?#????.??? | 4 16
???##????..?#? | 2 4
#???#?##???#??? | 5 25
?.????##?#.# | 4 16
??.?#?#?.?..???#.?? | 5 25
.?.???#???##????#? | 4 16
??.??#?###??? | 3 9
?.?.?#??..???????? | 2 4
.???.??????#? | 2 4
??.?##???# | 3 9
??.?.#??.??#. | 4 16
?#??.???.?. | 2 4
#???.?##?#.? | 4 16
##??????#?#????? | 3 9
??.??????????. | 3 9
?.##??#??#??.?#??? | 6 36
?????#??#?#?. | 3 9
?#??.???????. | 4 16
.?#??.?.#?.??? | 4 16
.?##?..#?#??#?????. | 3 9
?##?..???.. | 2 4
#???#..???.??? | 4 16
???#?#??..#?... | 2 4
????##???? | 2 4
#.?#???.????#?# | 4 16
????.#??.?##???.??#? | 5 25
??#??#???? | 3 9
??##?????#??? | 2 4
?.#???##?.???.#? | 3 9
#??.##?????.? | 4 16
?#????#?.??? | 4 16
..?.???????.? | 4 16
???#?.??.??. | 3 9
#???#??.#????.?# | 5 25
.??.#???.????#?#? | 3 9
.#???#?##????#?#??#? | 4 16
??????##?#??????? | 3 9
.??..???.?#?# | 3 9
????????.#?# | 4 16
###???????#?..???? | 2 4
?.?.????.??#??? | 5 25
????#??#?#.?? | 4 16
?#?.?.?#?#?.?? | 2 4
??.#??#??#???????. | 5 25
???.#???#??.? | 4 16
?#?#?#???. | 3 9
??.???.?##??##?. | 2 4
?#?#????.??? | 4 16
??#?.???#??#.?.?. | 3 9
?..#.#?#???????###? | 5 25
?????..???.. | 2 4
.?###..?#?#?????#? | 3 9
????###?????? | 2 4
##...?????.? | 3 9
.#??####???.? | 3 9
?????.#?????#? | 2 4
?..??????????# | 3 9
.??#??.???##???#???? | 4 16
#??.??????##?????? | 6 36
????.?###??#?.??? | 3 9
..??#?#?..#???#?. | 2 4
?#???##?????.???..? | 2 4
?#?????#.???????###? | 3 9
????#?.???#????? | 5 25
?###?????###??#???? | 3 9
???.??#??.?.??? | 4 16
..??#.#.?? | 3 9
.??.??????. | 3 9
.?..???.?? | 3 9
??#??????# | 2 4
?????#.?.??. | 3 9
?#?#?.####.???? | 3 9
.#??????#??? | 2 4
.?.???.????# | 4 16
?????#??#? | 3 9
.???.?.?##?.? | 3 9
??.???##???? | 2 4
??.????..?#? | 4 16
??.????##???.#??.? | 6 36
.#?..?#??? | 2 4
?????#?##???#??.?.?? | 2 4
?.??.?????#???.?.?? | 6 36
?.????#??.????.#?#? | 6 36
?#???..#??#??# | 3 9
???????.???? | 2 4
#??##??#???? | 2 4
##????#???##??? | 2 4
#?#??????????????? | 6 36
#???????.??.. | 4 16
??.#?#??#???#?. | 2 4
??.?#?##??.?#??#??? | 3 9
?.?#????????? | 4 16
???##??????# | 4 16
?#?###?#.??? | 3 9
??????#?#?? | 3 9
??#..?.???#??.#?.? | 5 25
???##?.?????? | 2 4
.#.#???.??..????#.? | 6 36
#??.#?.??.#.? | 4 16
??..?..???##..????? | 2 4
?.?.?#??##???...#? | 4 16
?#??##??#??#?##?? | 3 9
#?????.???.? | 2 4
???.?#?##?.???.? | 5 25
?.#??#?##??.?? | 2 4
?.?#?.?...##? | 2 4
?#??##?#???#?? | 3 9
.???.#??.?? | 3 9
??.??????#???? | 2 4
.?#????.#.?#???#? | 5 25
.?#??????# | 3 9
#..????.?.???.?#?? | 5 25
?.??##.????#????### | 2 4
#?????#??#.?? | 2 4
.#?##?#???###.?? | 3 9
??#..##??#? | 2 4
????#?????#.????# | 4 16
?.##????????#? | 4 16
?#?.?????????. | 4 16
?.??#?????#????? | 3 9
??#?????#.?????# | 5 25
???##?#????? | 4 16
#.????.????#?? | 3 9
??.??.?.?????.?. | 2 4
?.?#.?#????#???###? | 4 16
?#?#???##?..#??#??? | 4 16
??#...?.?. | 2 4
?#???#???.?? | 2 4
##?.?#??..??#?## | 3 9
????????#?#?? | 2 4
?????#???.??#? | 2 4
?.??????##.??###? | 2 4
?????#??##????# | 5 25
?##???#??###?#???.?. | 3 9
?#??..?????#???.#. | 6 36
???#...#?? | 2 4
?#????.?#? | 2 4
??##??????#??.??? | 4 16
#??#???#?###??#.??. | 3 9
.?###???????????# | 5 25
##??#?????#??#.??. | 6 36
???#??##???#?????? | 4 16
??????????? | 2 4
??#????#?#????? | 2 4
?????????#????????? | 5 25
?#???#.????##?#?# | 4 16
.????.???# | 3 9
.?##???#..? | 2 4
?????##?.??#.?#???# | 6 36
...###???#?#??#????. | 2 4
.#??.?.????#???? | 2 4
??????#?..??#??? | 4 16
?.?##.????# | 2 4
.???#??###??.?#. | 4 16
????#?????.#?? | 4 16
?????.???#? | 3 9
??#?#?#???##???.?? | 2 4
#.#.#????#?#?##?###? | 5 25
?????.??.?.?#?. | 5 25
.??#???.??????#? | 3 9
..??#???.???#??. | 3 9
???#?#??????????#??? | 2 4
..??#???????#??#?#? | 3 9
?????????#???#?? | 5 25
??????.??.?#? | 3 9
?.???##??##?#?#??? | 4 16
.?.???????#?#. | 3 9
.#???#?.??. | 2 4
.?#?????????#??. | 2 4
?????##???..?. | 3 9
??????????##??????? | 2 4
?.??..#?#????#????? | 3 9
??###??#???? | 3 9
##???#??##?#.?#???.# | 6 36
????#?#??#????#?.#?# | 5 25
????#??????#?.???.? | 2 4
#.??????.?#?.?#? | 5 25
..?.?#?#??? | 2 4
??.???????????#? | 4 16
???#???#?#??. | 3 9
?.#???##??.#??# | 5 25
#?????.??#???#??##?# | 3 9
.???????.?????? | 2 4
????#?##.#??..?#??# | 4 16
.?.#??#?.????# | 4 16
?#????.?#???.?? | 2 4
?????????.????#?? | 5 25
#?#???#????.? | 4 16
.??#.????#?????#? | 5 25
??.?#????###???# | 4 16
??????.?????????.??? | 2 4
????????.#?????? | 5 25
???..?#?#?#???? | 2 4
.?#??.????. | 2 4
..???????????..# | 2 4
#??.???????.??#?.?? | 6 36
??.?#.??.#..?. | 2 4
??????#??#???#?.??? | 3 9
#?#??##??????? | 4 16
.#?????###??????? | 3 9
##?????##?.#.???.# | 5 25
??????.????.?#?# | 5 25
#???????#.#?.? | 4 16
???.?##?#? | 2 4
???.#???##?#?#?#?.. | 3 9
.?????.#?????? | 2 4
?.?#???##??#????.# | 4 16
??##???#??#..?.. | 5 25
#.????#?.??#?? | 4 16
??.???..?#???.? | 5 25
?.#..??#?#?#.? | 3 9
?#?#####??#??.#??? | 3 9
.??.?#?#??????? | 3 9
?#??#???#?? | 2 4
?#??#????...????.?? | 2 4
.?.????????#?? | 3 9
?##?????#??? | 2 4
#????..?.?.?##???? | 5 25
?#####?#???????. | 3 9
?????????? | 2 4
#????.???.?? | 3 9
???.??#???? | 3 9
???.??.??.???? | 4 16
?#??????????.??? | 5 25
???.???????#..# | 5 25
??..??????#??###.?# | 4 16
?#???????.?? | 3 9
#?????..????????..? | 5 25
#????##?###?#??.??? | 3 9
?.??##?..#???.?? | 5 25
?????##?.??.#.??? | 5 25
?#???????????? | 4 16
???????#?.????????# | 5 25
?##.???#?????. | 3 9
#????#???#??????.?? | 3 9
##?##??.#?.??# | 4 16
???.?###?????#? | 3 9
#.????????? | 3 9
???#?.?#?????####??? | 5 25
??.????#?.????#?.? | 4 16
#??.???#???#?.??? | 3 9
??.???#??# | 3 9
????#.?.???##?? | 5 25
?.?.?.??.?.. | 4 16
???..?#?#?. | 3 9
#??.???#?###?????? | 3 9
?..?.?#???#??????? | 6 36
?.??##????#?? | 2 4
..??????..?#????? | 2 4
?????#??#?.???? | 2 4
...??#?.?? | 3 9
?#.????.#.#. | 4 16
????.?#?.???????#?? | 5 25
??#??#?#?.?.?.??#??. | 2 4
?#???##??##???#?? | 2 4
?#?###?.#?#????# | 5 25
??##????#????.?#??#. | 3 9
??.??#?..#???.. | 2 4
???#?.???.????? | 2 4
#???##?#?. | 2 4
#???.#????# | 3 9
?#???#?#?#?????##??? | 5 25
?#??#.??.??# | 4 16
??#??.???.???? | 4 16
?..#?????.?? | 2 4
???.???????????#?# | 4 16
.??????#??? | 3 9
??????????#????#? | 4 16
#??.??..????#.#??? | 6 36
?#?????????? | 2 4
##.????.?????##.? | 5 25
##??.??#?????#??.? | 3 9
.???..?#?? | 2 4
##??.???????#. | 3 9
?..??#???.? | 2 4
?#?#??????????. | 2 4
#???.?.#?#.? | 4 16
??????#.?? | 3 9
?.??...???#?????#?. | 3 9
##.?.?????????.#?.? | 5 25
?#??#???.??? | 3 9
??#?.?.?.# | 3 9
?.?#????#.????????#? | 3 9
?#????????.??? | 3 9
?.???.#?.????.??## | 6 36
#??.#???????????? | 3 9
?#?????##?#??????? | 5 25
?.?#???#??###.#??.#. | 6 36
????????????.??.? | 5 25
?#??#????.#?#. | 4 16
##?#??.#?.????????.. | 4 16
?..?????#..?#??.. | 4 16
.#?#.?##?????.#??? | 5 25
.#???.???#?.? | 4 16
?##??????????# | 4 16
?##??#??????? | 2 4
?#???.##?#?? | 4 16
???.?#???##?? | 4 16
???????#?.#???? | 5 25
???.#????#??. | 2 4
#??????#??? | 3 9
?#???#.??? | 3 9
????#??.## | 3 9
?.#.?#???#??.?#???#? | 5 25
?#??#??#..???#?? | 5 25
.#??????#?. | 3 9
????##??.??#. | 2 4
.?????#?.???#?? | 5 25
?????..#?. | 3 9
..??#???.?????#?.? | 2 4
???#??.??##? | 2 4
.#?.?????????.? | 4 16
??#??#??#.? | 3 9
#..???.???#??.?#?.? | 6 36
???#???.##?##?? | 4 16
????#####??##???? | 4 16
.#????#?.????? | 4 16
.??.????.????? | 2 4
?..?#.#????#???#.? | 2 4
???????###.#? | 4 16
??..?##?#??.?.? | 2 4
.???#???????.??#?#?? | 6 36
?#??.????.. | 2 4
??#?.?##.???.?##?? | 4 16
???#??#??#????.##? | 6 36
.#??.?.??#?#.#?#.# | 5 25
?#???.?.??? | 3 9
#..#??????#???.?#??? | 3 9
??#????##.?..?? | 4 16
.##?#????.?.???# | 5 25
??###???#???????.?? | 3 9
?#???##???#.??#????? | 5 25
#???#??.??.????? | 4 16
??#?.?##?#?#?#??#? | 2 4
??.#???#??? | 3 9
##???#??##????? | 3 9
?##?#?????. | 2 4
.????#?.??#????#??? | 5 25
?.#??#?#??#???.##?. | 4 16
?.???##??. | 3 9
?.?#??##?#??##?.? | 3 9
??#??.?#???? | 2 4
.???????.?##? | 3 9
?????##??.?????.??# | 5 25
??#???##?.???? | 2 4
???#?#??#??.?? | 4 16
???????#?#?? | 3 9
.???..##?? | 2 4
???..????..???#?? | 5 25
?????..????? | 2 4
???#?#???#???#???? | 3 9
????#?...??.?? | 2 4
???????#????????#? | 3 9
??##.??????? | 3 9
.#???#.????#???.?? | 5 25
??????.?.??? | 4 16
???.???????##?# | 4 16
##.?.??????????? | 2 4
???.#??#.? | 3 9
?#??#?#?.? | 2 4
???.#??#?#?##???#? | 2 4
?????.?????.# | 3 9
????..#???.? | 2 4
?????##????##????#?? | 3 9
??.#?#???????.??# | 3 9
?????.?#?#???.?????? | 6 36
????#??##.?????.? | 4 16
??##?...#?? | 3 9
??#???##?.????#??? | 3 9
#??#??????.?.??#?? | 4 16
.?.??#????????.#???? | 2 4
#????#??#? | 2 4
?.#????###????? | 3 9
??????????#?.? | 2 4
?.??#?..?.???.?.. | 2 4
.????..?## | 2 4
?#?..#..?? | 3 9
??????##?##.??????. | 6 36
???.?.??#?##? | 2 4
..?##?###?#?#?.??## | 3 9
??##????#??#???.? | 3 9
.?..???.??.?..? | 2 4
?????.?????? | 2 4
?.#?.??.??? | 2 4
###.??.#?? | 3 9
????...?????##.??. | 3 9
??#..???..???##?. | 3 9
?????????????##???? | 4 16
?.???????? | 2 4
?.??..#????? | 3 9
?#.?????##. | 2 4
#??##???#?????#? | 4 16
.?#???#?##????.?.? | 3 9
?#????#????##?#??#?# | 3 9
.??.???#??#. | 4 16
?????.?#?#?#??# | 5 25
.???.??##??#??.?? | 2 4
?.??##?.???#?? | 2 4
???#?##????#.???. | 2 4
.???????.#.#?.????# | 6 36
#??#??.??? | 3 9
?????.??.####??#??.? | 6 36
?..??.#???#?#????#? | 5 25
???#???.#.?????? | 5 25
?##??????.??.??? | 4 16
.?#??.???#??. | 2 4
???????#?# | 3 9
???..?.????? | 4 16
.?????.???? | 3 9
?.?????#??. | 3 9
.#????#??????? | 3 9
#?#???.?.??.?.????# | 5 25
?.#??????????. | 2 4
?#????.#??? | 3 9
???#???.???#? | 2 4
.????????? | 2 4
.??#???.???.#???? | 4 16
#?#??????. | 2 4
#.????#????? | 3 9
?.#???.??????#???# | 6 36
??????#?????.???. | 2 4
???..?.???? | 2 4
?.??.##??? | 2 4
#?.???#.?.#????? | 5 25
?????##??#??#??#??. | 5 25
..#??.?????.???. | 5 25
?#?#.?#??#?#?????#?# | 3 9
???#?.???????#? | 4 16
????####???#??#?? | 2 4
?.#???##??##.?????## | 2 4
???#?#???#??#???. | 4 16
???..?#??#??#??? | 2 4
???.?#???#? | 3 9
?##??????????#?????? | 3 9
?????#.#??? | 2 4
#???#??.????#???# | 5 25
??.?##?#?#???? | 2 4
#.??.???????#??? | 3 9
.#????.?#??##? | 2 4
???#?#???????? | 2 4
???#?????#?#? | 4 16
??#.?#.??????????. | 5 25
?.?.????????# | 3 9
?#?#?.??????##????? | 4 16
?##???.????.?#? | 4 16
.?????#..???#?#?#?# | 2 4
?###?#????? | 3 9
???#.????.?# | 4 16
?????.??????# | 3 9
.#??????###??#?.?? | 5 25
?#??.?.?#..?? | 3 9
??????#??? | 2 4
??#?#?????.? | 2 4
???.?##?.??#?#?? | 2 4
?.??.???#??? | 2 4
.????..??.? | 2 4
?#?#??.#????#???.. | 2 4
????????#?#????? | 2 4
?.??.??##??#??##??? | 4 16
....?#??.?#.???#???? | 3 9
????.???????#.?# | 3 9
?#????#.?#????#?? | 5 25
???????#????..#? | 5 25
#?.???#??#?? | 2 4
.????#??#? | 3 9
???#???..????? | 3 9
??????????? | 3 9
?.??#???#?????? | 4 16
#??????????..?. | 5 25
##..????#?.?.??# | 5 25
#??#.?#?##??#?. | 2 4
.?.#?#?#.?????? | 5 25
...?#??#.???.??? | 3 9
??#.?##??#.? | 4 16
???##??#????????#?# | 6 36
????????????? | 4 16
?.????..#?????#???? | 5 25
???.???.?#?#?##.#?? | 4 16
.?.??.??#.??. | 2 4
#.??..???? | 2 4
.??.?#???##?##??? | 4 16
#?###?????.?. | 3 9
?##?.?.????????.? | 4 16
???????#??????? | 4 16
??#??#???#???? | 3 9
##??#???.???? | 3 9
...#?????..??##??..? | 2 4
#?.??????#??#???# | 5 25
???????#?##?? | 4 16
#???????#?????##???? | 2 4
?.????#??.??????#?.# | 6 36
?.#????#?#?????.?? | 2 4
????#?###?#?#?????? | 2 4
??#??#?????. | 2 4
???????#??#?.???.? | 3 9
??#?#?#.???#?.?#?? | 4 16
??.##.????#????. | 5 25
??#???#????#.?.? | 5 25
?????#??##?#.?? | 2 4
?.?##????????.? | 4 16
??..???###?.???.##. | 4 16
??#???##??.??? | 2 4
?.?#???#??.??#? | 2 4
??#?###?#?..?.?????. | 5 25
????##?##?#???? | 3 9
#?..??????. | 3 9
.??#?.##?????? | 2 4
?#?.????##??.?? | 2 4
??#???.#??#???. | 2 4
?????.#.#?##???.??# | 5 25
?..?#.?###?#?? | 3 9
.????#????#????#.?.. | 2 4
.?#???.?????????#? | 3 9
??##?#?#???.??#? | 2 4
.?###?##.?#.?.?#???? | 5 25
?.#??????.? | 2 4
??#?????.?.??. | 4 16
??##??..#?????????# | 6 36
???##??????#? | 2 4
???#???#.???#.???? | 6 36
?.?????##..?#?#????# | 5 25
???####??##?#??#??? | 5 25
????#?#??##????.# | 2 4
??#??????##?... | 2 4
?#???????#?#???#..? | 4 16
#??#??.?????#?#? | 4 16
.???????...?.#??#? | 5 25
?###?#???.?? | 2 4
?#?##?#???#????#?.## | 4 16
??#?..?#???####????? | 3 9
.???#?##??#??#???? | 2 4
???????????.??? | 3 9
?#??????#???.? | 2 4
#??..#????????#?.?? | 4 16
.???#??#???##??????# | 2 4
???.?#???##??##????? | 3 9
.#.??????.##???#??? | 4 16
??????#?????? | 2 4
??.?#?##?#???#?#? | 4 16
#???.??????? | 4 16
???????.???????? | 3 9
???#???.??.??? | 4 16
???.??????.???.? | 3 9
??.??.????.?##?????? | 5 25
.?#?#??#?.??#? | 2 4
.#?##??##?.#?#?? | 3 9
?#????#??????.????? | 3 9
???#??.?#?#?? | 3 9
?????###???.. | 2 4
???##??#.????.?? | 5 25
?..???????? | 3 9
????.?##??????#??#? | 4 16
???#?##??.??????#?. | 5 25
.?#?##.?.???? | 3 9
??.?.??#.? | 3 9
?????.#??.???##?##?# | 3 9
????#???.? | 3 9
??????????.???#.?. | 6 36
??????#.#?????#? | 5 25
?#???#????#??#? | 4 16
?#.???????#????.??? | 6 36
?????.?.#??.???#.? | 2 4
?#?#?#????.#???#?. | 6 36
??.??#?##???. | 2 4
??#???????.??..## | 4 16
?..?.??.#?#????#???. | 4 16
..#??????#????? | 4 16
..?????#???##??.#? | 3 9
?.?###??..? | 2 4
?###.????????#####?? | 2 4
???##??#.#?#? | 3 9
?#?#??????.???? | 4 16
?..?.?????.? | 2 4
????#???.?? | 2 4
????#?#?.#??? | 3 9
?.?#?????. | 2 4
#???##???.?.???? | 4 16
#..#?????. | 3 9
??#????.#?????? | 4 16
?.???????#??##???? | 2 4
???.??#?????#?## | 2 4
?.?#...#?...?? | 3 9
???????????.??? | 2 4
...?#.???.??. | 3 9
.??.?#?????.? | 2 4
.???##??.????? | 4 16
#..?????#???#???#? | 4 16
..????##??????????? | 2 4
?.??..#?##?# | 2 4
Star 1: 12457
#+end_example

** Day 12 star 2
*** Problem statement
*** Solution
#+BEGIN_SRC python :results output
def star_2(path: str) -> int:
  with open(path,'r') as f:
     pass
  return 0
  
print("Star 2:", star_2("sample.txt"))
#+END_SRC

